app/controllers/permit_submissions_controller.rb

SELECT "permit_submissions".* FROM "permit_submissions" WHERE "permit_submissions"."user_id" = $1 ORDER BY created_at  [["user_id", "1e57537c-5ea1-4da0-b855-009fb5cc04e6"]]
SELECT "alerts".* FROM "alerts" ORDER BY created_at DESC LIMIT $1  [["LIMIT", 1]]
---
  def index
    sort_by = permit_index_params.fetch(:sort_by, nil)
    @search = permit_index_params.fetch(:search, nil)
    @permits = if sort_by
                 current_user.permit_submissions.order(sort_by)
               else
                 current_user.permit_submissions
               end
    @permits = @permits.search_permits(@search) if @search.present?
    @alert = Alert.order('created_at DESC').first

SELECT "permit_submissions".* FROM "permit_submissions" WHERE "permit_submissions"."user_id" = $1 AND "permit_submissions"."id" = $2 LIMIT $3  [["user_id", "1a640dca-19fa-4739-af77-c35518c8018e"], ["id", "a67bf44d-5919-448e-8f8e-26d7d33b386a"], ["LIMIT", 1]]
---
  def show
    @permit = current_user.permit_submissions.find(params.fetch(:id))

INSERT INTO "permit_submissions" ("name", "agency", "deadline", "status", "user_id", "created_at", "updated_at", "permit_type_id", "equipment", "location", "permittee") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11) RETURNING "id"
INSERT INTO "permit_documents" ("permit_submission_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["permit_submission_id", "3143066f-c152-47a9-ab55-eb979b47d6f6"], ["created_at", "2020-08-05 23:42:40.903462"], ["updated_at", "2020-08-05 23:42:40.903462"]]
INSERT INTO "permit_documents" ("permit_submission_id", "created_at", "updated_at") VALUES ($1, $2, $3) RETURNING "id"  [["permit_submission_id", "0bf7f129-c60f-4982-8b09-907a55b3c351"], ["created_at", "2020-08-05 20:17:34.582738"], ["updated_at", "2020-08-05 20:17:34.582738"]]
---
  def create
    @permit = PermitSubmission.new(permit_params)
    if @permit.save!
      @permit_document = @permit.permit_documents.create!
      @permit_document.document.attach(permit_document_params)
      @permit_document.save!